Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ256GA108.h
#define _CNPD4_CN60PDE_POSITION                  0x0000000C
#define _CNPD4_CN60PDE_MASK                      0x00001000
#define _CNPD4_CN60PDE_LENGTH                    0x00000001

#define _CNPD4_CN61PDE_POSITION                  0x0000000D
#define _CNPD4_CN61PDE_MASK                      0x00002000
#define _CNPD4_CN61PDE_LENGTH                    0x00000001

#define _CNPD4_CN62PDE_POSITION                  0x0000000E
#define _CNPD4_CN62PDE_MASK                      0x00004000
#define _CNPD4_CN62PDE_LENGTH                    0x00000001

#define _CNPD4_CN63PDE_POSITION                  0x0000000F
#define _CNPD4_CN63PDE_MASK                      0x00008000
#define _CNPD4_CN63PDE_LENGTH                    0x00000001

#define _CNPD5_CN64PDE_POSITION                  0x00000000
#define _CNPD5_CN64PDE_MASK                      0x00000001
#define _CNPD5_CN64PDE_LENGTH                    0x00000001

#define _CNPD5_CN65PDE_POSITION                  0x00000001
#define _CNPD5_CN65PDE_MASK                      0x00000002
#define _CNPD5_CN65PDE_LENGTH                    0x00000001

#define _CNPD5_CN66PDE_POSITION                  0x00000002
#define _CNPD5_CN66PDE_MASK                      0x00000004
#define _CNPD5_CN66PDE_LENGTH                    0x00000001

#define _CNPD5_CN67PDE_POSITION                  0x00000003
#define _CNPD5_CN67PDE_MASK                      0x00000008
#define _CNPD5_CN67PDE_LENGTH                    0x00000001

#define _CNPD5_CN68PDE_POSITION                  0x00000004
#define _CNPD5_CN68PDE_MASK                      0x00000010
#define _CNPD5_CN68PDE_LENGTH                    0x00000001

#define _CNPD5_CN69PDE_POSITION                  0x00000005
#define _CNPD5_CN69PDE_MASK                      0x00000020
#define _CNPD5_CN69PDE_LENGTH                    0x00000001

#define _CNPD5_CN70PDE_POSITION                  0x00000006
#define _CNPD5_CN70PDE_MASK                      0x00000040
#define _CNPD5_CN70PDE_LENGTH                    0x00000001

#define _CNPD5_CN71PDE_POSITION                  0x00000007
#define _CNPD5_CN71PDE_MASK                      0x00000080
#define _CNPD5_CN71PDE_LENGTH                    0x00000001

#define _CNPD5_CN72PDE_POSITION                  0x00000008
#define _CNPD5_CN72PDE_MASK                      0x00000100
#define _CNPD5_CN72PDE_LENGTH                    0x00000001

#define _CNPD5_CN73PDE_POSITION                  0x00000009
#define _CNPD5_CN73PDE_MASK                      0x00000200
#define _CNPD5_CN73PDE_LENGTH                    0x00000001

#define _CNPD5_CN74PDE_POSITION                  0x0000000A
#define _CNPD5_CN74PDE_MASK                      0x00000400
#define _CNPD5_CN74PDE_LENGTH                    0x00000001

#define _CNPD5_CN77PDE_POSITION                  0x0000000D
#define _CNPD5_CN77PDE_MASK                      0x00002000
#define _CNPD5_CN77PDE_LENGTH                    0x00000001

#define _CNPD5_CN78PDE_POSITION                  0x0000000E
#define _CNPD5_CN78PDE_MASK                      0x00004000
#define _CNPD5_CN78PDE_LENGTH                    0x00000001

#define _CNPD6_CN83PDE_POSITION                  0x00000003
#define _CNPD6_CN83PDE_MASK                      0x00000008
#define _CNPD6_CN83PDE_LENGTH                    0x00000001

#define _CNPD6_CN84PDE_POSITION                  0x00000004
#define _CNPD6_CN84PDE_MASK                      0x00000010
#define _CNPD6_CN84PDE_LENGTH                    0x00000001

#define _CNEN1_CN0IE_POSITION                    0x00000000
#define _CNEN1_CN0IE_MASK                        0x00000001
#define _CNEN1_CN0IE_LENGTH                      0x00000001

#define _CNEN1_CN1IE_POSITION                    0x00000001
#define _CNEN1_CN1IE_MASK                        0x00000002
#define _CNEN1_CN1IE_LENGTH                      0x00000001

#define _CNEN1_CN2IE_POSITION                    0x00000002
#define _CNEN1_CN2IE_MASK                        0x00000004
#define _CNEN1_CN2IE_LENGTH                      0x00000001

#define _CNEN1_CN3IE_POSITION                    0x00000003
#define _CNEN1_CN3IE_MASK                        0x00000008
#define _CNEN1_CN3IE_LENGTH                      0x00000001

#define _CNEN1_CN4IE_POSITION                    0x00000004
#define _CNEN1_CN4IE_MASK                        0x00000010
#define _CNEN1_CN4IE_LENGTH                      0x00000001

#define _CNEN1_CN5IE_POSITION                    0x00000005
#define _CNEN1_CN5IE_MASK                        0x00000020
#define _CNEN1_CN5IE_LENGTH                      0x00000001

#define _CNEN1_CN6IE_POSITION                    0x00000006
#define _CNEN1_CN6IE_MASK                        0x00000040
#define _CNEN1_CN6IE_LENGTH                      0x00000001

#define _CNEN1_CN7IE_POSITION                    0x00000007
#define _CNEN1_CN7IE_MASK                        0x00000080
#define _CNEN1_CN7IE_LENGTH                      0x00000001

#define _CNEN1_CN8IE_POSITION                    0x00000008
#define _CNEN1_CN8IE_MASK                        0x00000100
#define _CNEN1_CN8IE_LENGTH                      0x00000001

#define _CNEN1_CN9IE_POSITION                    0x00000009
#define _CNEN1_CN9IE_MASK                        0x00000200
#define _CNEN1_CN9IE_LENGTH                      0x00000001

#define _CNEN1_CN10IE_POSITION                   0x0000000A
#define _CNEN1_CN10IE_MASK                       0x00000400
#define _CNEN1_CN10IE_LENGTH                     0x00000001

#define _CNEN1_CN11IE_POSITION                   0x0000000B
#define _CNEN1_CN11IE_MASK                       0x00000800
#define _CNEN1_CN11IE_LENGTH                     0x00000001

#define _CNEN1_CN12IE_POSITION                   0x0000000C
#define _CNEN1_CN12IE_MASK                       0x00001000
#define _CNEN1_CN12IE_LENGTH                     0x00000001

#define _CNEN1_CN13IE_POSITION                   0x0000000D
#define _CNEN1_CN13IE_MASK                       0x00002000
#define _CNEN1_CN13IE_LENGTH                     0x00000001

#define _CNEN1_CN14IE_POSITION                   0x0000000E
#define _CNEN1_CN14IE_MASK                       0x00004000
#define _CNEN1_CN14IE_LENGTH                     0x00000001

#define _CNEN1_CN15IE_POSITION                   0x0000000F
#define _CNEN1_CN15IE_MASK                       0x00008000
#define _CNEN1_CN15IE_LENGTH                     0x00000001

#define _CNEN2_CN16IE_POSITION                   0x00000000
#define _CNEN2_CN16IE_MASK                       0x00000001
#define _CNEN2_CN16IE_LENGTH                     0x00000001

