Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ256GA108.h
#define _OC9CON1_OCM1_POSITION                   0x00000001
#define _OC9CON1_OCM1_MASK                       0x00000002
#define _OC9CON1_OCM1_LENGTH                     0x00000001

#define _OC9CON1_OCM2_POSITION                   0x00000002
#define _OC9CON1_OCM2_MASK                       0x00000004
#define _OC9CON1_OCM2_LENGTH                     0x00000001

#define _OC9CON1_OCFLT_POSITION                  0x00000004
#define _OC9CON1_OCFLT_MASK                      0x00000010
#define _OC9CON1_OCFLT_LENGTH                    0x00000001

#define _OC9CON1_ENFLT_POSITION                  0x00000007
#define _OC9CON1_ENFLT_MASK                      0x00000080
#define _OC9CON1_ENFLT_LENGTH                    0x00000001

#define _OC9CON1_OCTSEL0_POSITION                0x0000000A
#define _OC9CON1_OCTSEL0_MASK                    0x00000400
#define _OC9CON1_OCTSEL0_LENGTH                  0x00000001

#define _OC9CON1_OCTSEL1_POSITION                0x0000000B
#define _OC9CON1_OCTSEL1_MASK                    0x00000800
#define _OC9CON1_OCTSEL1_LENGTH                  0x00000001

#define _OC9CON1_OCTSEL2_POSITION                0x0000000C
#define _OC9CON1_OCTSEL2_MASK                    0x00001000
#define _OC9CON1_OCTSEL2_LENGTH                  0x00000001

#define _OC9CON2_SYNCSEL_POSITION                0x00000000
#define _OC9CON2_SYNCSEL_MASK                    0x0000001F
#define _OC9CON2_SYNCSEL_LENGTH                  0x00000005

#define _OC9CON2_OCTRIS_POSITION                 0x00000005
#define _OC9CON2_OCTRIS_MASK                     0x00000020
#define _OC9CON2_OCTRIS_LENGTH                   0x00000001

#define _OC9CON2_TRIGSTAT_POSITION               0x00000006
#define _OC9CON2_TRIGSTAT_MASK                   0x00000040
#define _OC9CON2_TRIGSTAT_LENGTH                 0x00000001

#define _OC9CON2_OCTRIG_POSITION                 0x00000007
#define _OC9CON2_OCTRIG_MASK                     0x00000080
#define _OC9CON2_OCTRIG_LENGTH                   0x00000001

#define _OC9CON2_OC32_POSITION                   0x00000008
#define _OC9CON2_OC32_MASK                       0x00000100
#define _OC9CON2_OC32_LENGTH                     0x00000001

#define _OC9CON2_OCINV_POSITION                  0x0000000C
#define _OC9CON2_OCINV_MASK                      0x00001000
#define _OC9CON2_OCINV_LENGTH                    0x00000001

#define _OC9CON2_FLTTRIEN_POSITION               0x0000000D
#define _OC9CON2_FLTTRIEN_MASK                   0x00002000
#define _OC9CON2_FLTTRIEN_LENGTH                 0x00000001

#define _OC9CON2_FLTOUT_POSITION                 0x0000000E
#define _OC9CON2_FLTOUT_MASK                     0x00004000
#define _OC9CON2_FLTOUT_LENGTH                   0x00000001

#define _OC9CON2_FLTMD_POSITION                  0x0000000F
#define _OC9CON2_FLTMD_MASK                      0x00008000
#define _OC9CON2_FLTMD_LENGTH                    0x00000001

#define _OC9CON2_SYNCSEL0_POSITION               0x00000000
#define _OC9CON2_SYNCSEL0_MASK                   0x00000001
#define _OC9CON2_SYNCSEL0_LENGTH                 0x00000001

#define _OC9CON2_SYNCSEL1_POSITION               0x00000001
#define _OC9CON2_SYNCSEL1_MASK                   0x00000002
#define _OC9CON2_SYNCSEL1_LENGTH                 0x00000001

#define _OC9CON2_SYNCSEL2_POSITION               0x00000002
#define _OC9CON2_SYNCSEL2_MASK                   0x00000004
#define _OC9CON2_SYNCSEL2_LENGTH                 0x00000001

#define _OC9CON2_SYNCSEL3_POSITION               0x00000003
#define _OC9CON2_SYNCSEL3_MASK                   0x00000008
#define _OC9CON2_SYNCSEL3_LENGTH                 0x00000001

#define _OC9CON2_SYNCSEL4_POSITION               0x00000004
#define _OC9CON2_SYNCSEL4_MASK                   0x00000010
#define _OC9CON2_SYNCSEL4_LENGTH                 0x00000001

#define _OC9CON2_FLTMODE_POSITION                0x0000000F
#define _OC9CON2_FLTMODE_MASK                    0x00008000
#define _OC9CON2_FLTMODE_LENGTH                  0x00000001

#define _I2C1CON_SEN_POSITION                    0x00000000
#define _I2C1CON_SEN_MASK                        0x00000001
#define _I2C1CON_SEN_LENGTH                      0x00000001

#define _I2C1CON_RSEN_POSITION                   0x00000001
#define _I2C1CON_RSEN_MASK                       0x00000002
#define _I2C1CON_RSEN_LENGTH                     0x00000001

#define _I2C1CON_PEN_POSITION                    0x00000002
#define _I2C1CON_PEN_MASK                        0x00000004
#define _I2C1CON_PEN_LENGTH                      0x00000001

#define _I2C1CON_RCEN_POSITION                   0x00000003
#define _I2C1CON_RCEN_MASK                       0x00000008
#define _I2C1CON_RCEN_LENGTH                     0x00000001

#define _I2C1CON_ACKEN_POSITION                  0x00000004
#define _I2C1CON_ACKEN_MASK                      0x00000010
#define _I2C1CON_ACKEN_LENGTH                    0x00000001

#define _I2C1CON_ACKDT_POSITION                  0x00000005
#define _I2C1CON_ACKDT_MASK                      0x00000020
#define _I2C1CON_ACKDT_LENGTH                    0x00000001

#define _I2C1CON_STREN_POSITION                  0x00000006
#define _I2C1CON_STREN_MASK                      0x00000040
#define _I2C1CON_STREN_LENGTH                    0x00000001

#define _I2C1CON_GCEN_POSITION                   0x00000007
#define _I2C1CON_GCEN_MASK                       0x00000080
#define _I2C1CON_GCEN_LENGTH                     0x00000001

#define _I2C1CON_SMEN_POSITION                   0x00000008
#define _I2C1CON_SMEN_MASK                       0x00000100
#define _I2C1CON_SMEN_LENGTH                     0x00000001

#define _I2C1CON_DISSLW_POSITION                 0x00000009
#define _I2C1CON_DISSLW_MASK                     0x00000200
#define _I2C1CON_DISSLW_LENGTH                   0x00000001

#define _I2C1CON_A10M_POSITION                   0x0000000A
#define _I2C1CON_A10M_MASK                       0x00000400
#define _I2C1CON_A10M_LENGTH                     0x00000001

#define _I2C1CON_IPMIEN_POSITION                 0x0000000B
#define _I2C1CON_IPMIEN_MASK                     0x00000800
#define _I2C1CON_IPMIEN_LENGTH                   0x00000001

#define _I2C1CON_SCLREL_POSITION                 0x0000000C
#define _I2C1CON_SCLREL_MASK                     0x00001000
#define _I2C1CON_SCLREL_LENGTH                   0x00000001

#define _I2C1CON_I2CSIDL_POSITION                0x0000000D
#define _I2C1CON_I2CSIDL_MASK                    0x00002000
#define _I2C1CON_I2CSIDL_LENGTH                  0x00000001

#define _I2C1CON_I2CEN_POSITION                  0x0000000F
#define _I2C1CON_I2CEN_MASK                      0x00008000
#define _I2C1CON_I2CEN_LENGTH                    0x00000001

#define _I2C1STAT_TBF_POSITION                   0x00000000
#define _I2C1STAT_TBF_MASK                       0x00000001
#define _I2C1STAT_TBF_LENGTH                     0x00000001

#define _I2C1STAT_RBF_POSITION                   0x00000001
#define _I2C1STAT_RBF_MASK                       0x00000002
#define _I2C1STAT_RBF_LENGTH                     0x00000001

